* Inner join
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database workshop
:END:
** Write an SQL query to display all devices along with all the parts that make them up. We only want to display the name of the devices. Its parts should only display the part_number.


#+BEGIN_SRC sql
  SELECT d.name, p.part_number
    FROM devices AS d
           INNER JOIN parts AS p
               ON d.id = p.device_id;
         
#+END_SRC

#+RESULTS:
| name          | part_number |
|---------------+-------------|
| Accelerometer |           1 |
| Accelerometer |           2 |
| Accelerometer |           3 |
| Gyroscope     |           4 |
| Gyroscope     |           5 |
| Gyroscope     |           6 |
| Gyroscope     |           7 |
| Gyroscope     |           8 |
